{
  "_id": "5adab204929d249e5faefb52",
  "_type": "CodeStage",
  "code_file_ids": [
    "5adab204929d249e5faefb54",
    "5adab205929d249e5faefb5f",
    "5adab205929d249e5faefb61",
    "5b3aef46d9f99763e5c4b4f0",
    "5b3ae6a9d9f99763e5c4b4cc"
  ],
  "completion_message": "### Yes.\n\nYou successfully built a smart contract from scratch, a simple JavaScript API to interact with that smart contract! You were also introduced to pivotal technologies such as Metamask, Truffle, and Web3.js. These technologies will be crucial to your progress as a blockchain developer.\n\n**Continue to our final stage where you can download your project into a framework of your choice!**\n",
  "container_id": "5adab204929d249e5faefb4c",
  "details": "## Constructor\n\nWe will now build a JavaScript Approve function for your application in order to approve the escrow on the blockchain.\n\n## Approve\n\nCreate an approve function that takes in the `escrowContractAddress` and an `arbiterAddress` and returns the call to the smart contracts approve function. \n\nYou'll need to assign the `escrowContractAddress` to the web3 contract you created. The web3 address can be assigned using the following syntax:\n\n```\nweb3ContractInstance.options.address = 0xec...\n```\n\nFinally, return the promise to the contract approve function from within your JavaScript function. \n\nThis is accomplished by accessing the property `methods` on the contract instance. This will give us access to all methods contained within the contract. \n\nInvoke the `approve` function within `methods` then `send` it from the `arbiterAddress` (the only address who can approve).\n\n```\nreturn EscrowContract.methods['methodName']().send({\n   from: 0xec...\n})\n```\n",
  "language": "javascript",
  "language_version": "6.x/babel",
  "position": 9,
  "task": "## Approve Function\n\nNow we're going to write the JavaScript function to interact with the `approve` function we wrote on the contract which allows the arbiter to move the funds.\n\n1. Use the Escrow Address passed to the `approve` function to instantiate the Escrow Contract at that address\n2. Call the Escrow Contract approve function to transfer the funds to the beneficiary\n",
  "test_framework": "mocha_bdd",
  "title": "JS Approve",
  "updated_at": "2018-10-16T01:50:10.323Z",
  "created_at": "2018-10-16T01:50:10.323Z"
}