{
  "_id": "5b2729e8d9f9970e8ed24191",
  "_type": "CodeStage",
  "code_file_ids": [
    "5b2b27ced9f99705e56c5ab8",
    "5b2d720f929d242a2eee97bf",
    "5b25b5ccd9f997a91fff3d02",
    "5b2d7667929d243182d30b7e"
  ],
  "completion_message": "## You've saved the Day! \n\nWay to go! With that pesky re-entrancy bug taken care of, our friend, the squirrel can survive the next crypto winter. ",
  "container_id": "5b256f43d9f997a91fff3d01",
  "details": "### Stash.sol \n\nThe `Stash.sol` smart contract should function as a limited bank. It allows smart contracts to add to their balances incrementally and withdraw balances all at once. It keeps track of all balances in it's `balances` mapping, which maps an address to the balance that it is allowed to access. \n\n### Chipmunk.sol\n\nThe `Chipmunk.sol` smart contract is attempting to exploit the security vulnerability in the Stash smart contract. This contract should be allowed to deposit and withdraw balances without affecting the funds of other accounts. \n\n### Squirrel.sol \n\nThe `Squirrel.sol` smart contract is interacting with the `Stash.sol` in the intended way, simply trying to store and withdraw the balances it should have access to. \n\n### tests.js \n\nThis file holds JavaScript tests that are used to test the functionality of our smart contracts. It ensures that the squirrel can properly deposit and withdraw. It also checks to make sure that the chipmunk can only deposit and withdraw the funds that they put in. ",
  "language": "solidity",
  "language_version": "0.4.19",
  "position": 0,
  "task": "## Decentralized Stash  \n\nOur squirrel friend is excited because today we unveil our brand new decentralized Stash smart contract! Squirrels can finally forget about all those harsh crypto winters! \n\nUnfortunately word amongst the forest critters is that the `Stash.sol` has a security vulnerability! Can you find the vulnerability and fix it before some chipmunk comes along and takes the squirrels hard-earned Wei?\n\n**Fix the vulnerable `Stash.sol` Smart Contract before the chipmunk comes along and steals the squirrel's balance.** \n\n*Once you believe you have fixed the code, use \"Run Tests\" to test and make sure it functions properly and passes all test cases.*",
  "test_framework": "truffle_with_mocha",
  "title": "Stash Attack",
  "validated_contract": "Stash",
  "updated_at": "2018-10-16T01:50:10.162Z",
  "created_at": "2018-10-16T01:50:10.162Z"
}