{
  "_id": "5adab204929d249e5faefb51",
  "_type": "UiStage",
  "completion_message": "### TestNet Stage Complete! \n\nThat was an interesting experience, huh? Nothing quite like the old days where when you needed test ether you had to arrange a meeting on a deserted street corner in the sketchy part of town. \n\nLet's write some functions to begin interacting with our Escrow.",
  "component_name": "DeploymentStage",
  "configuration": {
    "json_code_file_id": "5adab204929d249e5faefb54",
    "deploy_code_file_id": "5adab204929d249e5faefb5c",
    "test_deployment_code_file_id": "5adab205929d249e5faefb5e"
  },
  "container_id": "5adab204929d249e5faefb4c",
  "details": "## Testnet\n\nBefore deploying to the mainnet, we will deploy to the testnet. This allows us to test our application without using any ether. However, we will be using test-ether in order to deploy and interact with our smart contract within our testing environment.\n\n## MetaMask\n\nMetamask is a software that allows us to interact with the blockchain from the comfort of our browser. Visit the [MetaMask website](https://metamask.io/) to download the browser plugin.\n\nOnce installed, click on the Metamask icon in your browser and follow the steps to create your wallet address. Make sure to securely store your password and seed phrase! Your seed phrase is will allow you to access your account if you ever forget your password.\n\nWhen logged in, you can check your account balance and interact with buy/sell transactions on the blockchain. By default, your account will most likely be set to the Main Ethereum Network. You will want to connect to a test network of your choice in order to receive test-ether from a faucet.\n\n## Faucets\n\nA faucet is an industry term used to describe a network that **‘drips’** test-ether to a provided public Ethereum address. The test-ether is exactly as the name states, it has no real value and is used specifically for testing purposes.\n\nHere are some faucets to check out on different networks:\n\n- [Kovan](https://github.com/kovan-testnet/faucet)\n- [Ropsten](http://faucet.ropsten.be:3001/)\n- [Rinkeby](https://faucet.rinkeby.io/)\n\nEach faucet has a different way to request test-ether including live-chats where you provide your public key and amount needed as well as an input box that sends a fixed amount of test-ether. We recommend Ropsten as you only need to provide your public key and you will receive 1 Ether which is more than enough to test small transactions such as deploying smart contracts.\n\n> **Remember: Ether’s smallest unit is the wei ( *1,000,000,000,000,000,000 wei is equal to 1 eth*)**\n\nAfter requesting the test-ether, check your Metamask account on the corresponding test network to make sure the test-ether was deposited.\n\nNow we are ready to deploy! **Click the deploy contract button.**\n\nA Metamask notification will appear giving you an overview of the transaction including the associated fee (on the testnet, this fee is subtracted from test-ether). Click Submit to confirm and deploy your contract to the blockchain.\n\nYou can check the status of the transaction by going into Metamask and clicking on the most recent transaction in the sent transactions log. This will re-route you to [Etherscan](https://etherscan.io/) which holds the transaction details and can viewed as your receipt of the transaction.\n",
  "position": 8,
  "task": "## Deploy to the TestNet\n\nBefore deploying to the mainnet, we will deploy to the testnet. We will need to acquire some testnet ether in order to deploy and interact with our smart contract.\n\n1. Download or Login to the [Metamask](?tab=details&scroll=Metamask) extension\n2. Request test-ether from a [faucet](?tab=details&scroll=Faucets)\n3. Deploy your contract to the TestNet\n",
  "title": "TestNet",
  "updated_at": "2018-10-16T01:50:10.768Z",
  "created_at": "2018-10-16T01:50:10.768Z"
}